{
  "\n": 4, 
  "\r": 5, 
  " ": 0, 
  "!": 33, 
  "\"": 131, 
  "#": 168, 
  "$": 249, 
  "%": 71, 
  "&": 86, 
  "'": 113, 
  "(": 90, 
  ")": 81, 
  "*": 117, 
  "+": 122, 
  ",": 37, 
  "-": 57, 
  ".": 25, 
  "/": 40, 
  "0": 43, 
  "1": 48, 
  "2": 51, 
  "3": 58, 
  "4": 61, 
  "5": 60, 
  "6": 66, 
  "7": 59, 
  "8": 65, 
  "9": 63, 
  ":": 53, 
  ";": 159, 
  "<": 174, 
  "=": 75, 
  ">": 243, 
  "?": 20, 
  "@": 144, 
  "A": 74, 
  "B": 82, 
  "C": 78, 
  "D": 80, 
  "E": 79, 
  "F": 108, 
  "G": 98, 
  "H": 102, 
  "I": 83, 
  "J": 121, 
  "K": 114, 
  "L": 84, 
  "M": 89, 
  "N": 85, 
  "O": 116, 
  "P": 99, 
  "Q": 126, 
  "R": 95, 
  "S": 77, 
  "T": 87, 
  "U": 94, 
  "V": 110, 
  "W": 103, 
  "X": 124, 
  "Y": 92, 
  "Z": 132, 
  "[": 260, 
  "\\": 360, 
  "]": 382, 
  "_": 73, 
  "a": 35, 
  "b": 68, 
  "c": 49, 
  "d": 55, 
  "e": 32, 
  "f": 67, 
  "g": 54, 
  "h": 46, 
  "i": 38, 
  "j": 109, 
  "k": 69, 
  "l": 44, 
  "m": 45, 
  "n": 39, 
  "o": 34, 
  "p": 50, 
  "q": 107, 
  "r": 42, 
  "s": 36, 
  "t": 31, 
  "u": 52, 
  "v": 76, 
  "w": 56, 
  "x": 111, 
  "y": 64, 
  "z": 97, 
  "|": 231, 
  "~": 173, 
  "\u00c0": 331, 
  "\u00e7": 362, 
  "\u00e8": 405, 
  "\u00e9": 172, 
  "\u00ed": 285, 
  "\u00f3": 277, 
  "\u05bf": 213, 
  "\u05d0": 6, 
  "\u05d1": 11, 
  "\u05d2": 28, 
  "\u05d3": 16, 
  "\u05d4": 3, 
  "\u05d5": 2, 
  "\u05d6": 24, 
  "\u05d7": 19, 
  "\u05d8": 27, 
  "\u05d9": 1, 
  "\u05da": 29, 
  "\u05db": 17, 
  "\u05dc": 7, 
  "\u05dd": 18, 
  "\u05de": 9, 
  "\u05df": 26, 
  "\u05e0": 13, 
  "\u05e1": 23, 
  "\u05e2": 14, 
  "\u05e3": 47, 
  "\u05e4": 21, 
  "\u05e5": 70, 
  "\u05e6": 22, 
  "\u05e7": 15, 
  "\u05e8": 10, 
  "\u05e9": 12, 
  "\u05ea": 8, 
  "\u05f3": 72, 
  "\u05f4": 105, 
  "\u200d": 145, 
  "\u200e": 30, 
  "\u200f": 309, 
  "\u2013": 397, 
  "\u2014": 306, 
  "\u2019": 136, 
  "\u201c": 230, 
  "\u201d": 237, 
  "\u2022": 282, 
  "\u2026": 201, 
  "\u20aa": 440, 
  "\u23f0": 238, 
  "\u2600": 248, 
  "\u2601": 252, 
  "\u2604": 315, 
  "\u260e": 359, 
  "\u2615": 345, 
  "\u261d": 246, 
  "\u2639": 152, 
  "\u263a": 146, 
  "\u2640": 220, 
  "\u2642": 169, 
  "\u2665": 208, 
  "\u2695": 335, 
  "\u26c5": 341, 
  "\u26fa": 349, 
  "\u2708": 233, 
  "\u270a": 254, 
  "\u270c": 125, 
  "\u2728": 148, 
  "\u2744": 206, 
  "\u2764": 93, 
  "\u2b50": 235, 
  "\u30b3": 387, 
  "\u30cb": 320, 
  "\u30dc": 367, 
  "\u30e5": 438, 
  "\u30f3": 392, 
  "\u30fc": 368, 
  "\ud83c": 62, 
  "\ud83d": 41, 
  "\ud83e": 91, 
  "\udc03": 324, 
  "\udc04": 350, 
  "\udc05": 214, 
  "\udc07": 428, 
  "\udc08": 223, 
  "\udc09": 344, 
  "\udc0b": 294, 
  "\udc0c": 419, 
  "\udc0d": 313, 
  "\udc0f": 274, 
  "\udc14": 269, 
  "\udc19": 266, 
  "\udc1b": 399, 
  "\udc1e": 264, 
  "\udc1f": 364, 
  "\udc21": 412, 
  "\udc22": 436, 
  "\udc23": 226, 
  "\udc25": 185, 
  "\udc27": 430, 
  "\udc2a": 372, 
  "\udc2b": 401, 
  "\udc2f": 278, 
  "\udc30": 386, 
  "\udc31": 149, 
  "\udc32": 311, 
  "\udc33": 329, 
  "\udc34": 354, 
  "\udc37": 431, 
  "\udc38": 318, 
  "\udc39": 267, 
  "\udc3a": 234, 
  "\udc3b": 403, 
  "\udc3c": 421, 
  "\udc3d": 442, 
  "\udc3e": 265, 
  "\udc3f": 365, 
  "\udc40": 188, 
  "\udc43": 258, 
  "\udc44": 357, 
  "\udc46": 302, 
  "\udc4a": 176, 
  "\udc4b": 135, 
  "\udc4c": 88, 
  "\udc4d": 106, 
  "\udc4f": 142, 
  "\udc50": 291, 
  "\udc51": 415, 
  "\udc60": 292, 
  "\udc63": 261, 
  "\udc68": 225, 
  "\udc69": 228, 
  "\udc6b": 406, 
  "\udc6f": 147, 
  "\udc70": 293, 
  "\udc73": 334, 
  "\udc74": 272, 
  "\udc75": 384, 
  "\udc76": 409, 
  "\udc7e": 343, 
  "\udc81": 189, 
  "\udc82": 439, 
  "\udc83": 150, 
  "\udc86": 411, 
  "\udc87": 418, 
  "\udc8b": 385, 
  "\udc8f": 229, 
  "\udc90": 396, 
  "\udc94": 363, 
  "\udc9b": 157, 
  "\udca3": 316, 
  "\udca6": 247, 
  "\udca7": 250, 
  "\udca9": 192, 
  "\udcaa": 154, 
  "\udcaf": 353, 
  "\udcb0": 402, 
  "\udcb8": 257, 
  "\udcba": 289, 
  "\udcc2": 443, 
  "\udccc": 434, 
  "\udcdb": 389, 
  "\udd11": 395, 
  "\udd12": 420, 
  "\udd14": 184, 
  "\udd15": 194, 
  "\udd16": 186, 
  "\udd17": 133, 
  "\udd18": 336, 
  "\udd19": 327, 
  "\udd1c": 251, 
  "\udd1e": 330, 
  "\udd20": 218, 
  "\udd21": 177, 
  "\udd23": 129, 
  "\udd25": 170, 
  "\udd26": 240, 
  "\udd28": 337, 
  "\udd2a": 166, 
  "\udd2b": 413, 
  "\udd2c": 437, 
  "\udd2d": 222, 
  "\udd2f": 216, 
  "\udd34": 283, 
  "\udd37": 190, 
  "\udd3a": 355, 
  "\udd47": 444, 
  "\udd4a": 358, 
  "\udd57": 445, 
  "\udd74": 287, 
  "\udd75": 281, 
  "\udd7a": 273, 
  "\udd80": 410, 
  "\udd84": 379, 
  "\udd90": 304, 
  "\udd91": 290, 
  "\udd94": 380, 
  "\udd95": 351, 
  "\udde1": 356, 
  "\udded": 425, 
  "\uddee": 333, 
  "\uddef": 286, 
  "\uddf0": 416, 
  "\uddf1": 391, 
  "\uddf5": 271, 
  "\uddfd": 426, 
  "\uddff": 378, 
  "\ude00": 143, 
  "\ude01": 151, 
  "\ude02": 101, 
  "\ude03": 123, 
  "\ude04": 163, 
  "\ude05": 193, 
  "\ude07": 394, 
  "\ude09": 215, 
  "\ude0a": 156, 
  "\ude0b": 308, 
  "\ude0c": 162, 
  "\ude0d": 138, 
  "\ude0e": 212, 
  "\ude0f": 375, 
  "\ude10": 140, 
  "\ude11": 253, 
  "\ude12": 299, 
  "\ude13": 276, 
  "\ude14": 130, 
  "\ude15": 120, 
  "\ude16": 178, 
  "\ude17": 398, 
  "\ude18": 104, 
  "\ude1c": 171, 
  "\ude1e": 370, 
  "\ude1f": 180, 
  "\ude21": 179, 
  "\ude22": 242, 
  "\ude23": 160, 
  "\ude24": 317, 
  "\ude25": 207, 
  "\ude27": 400, 
  "\ude28": 270, 
  "\ude29": 127, 
  "\ude2b": 199, 
  "\ude2c": 187, 
  "\ude2d": 305, 
  "\ude2e": 175, 
  "\ude2f": 204, 
  "\ude30": 221, 
  "\ude31": 153, 
  "\ude32": 300, 
  "\ude33": 112, 
  "\ude34": 158, 
  "\ude35": 346, 
  "\ude36": 202, 
  "\ude37": 297, 
  "\ude39": 288, 
  "\ude3a": 203, 
  "\ude3b": 200, 
  "\ude3c": 196, 
  "\ude3d": 219, 
  "\ude3e": 373, 
  "\ude3f": 155, 
  "\ude40": 307, 
  "\ude41": 191, 
  "\ude42": 301, 
  "\ude43": 118, 
  "\ude44": 164, 
  "\ude45": 181, 
  "\ude46": 312, 
  "\ude47": 217, 
  "\ude4b": 137, 
  "\ude4c": 161, 
  "\ude4d": 414, 
  "\ude4f": 139, 
  "\ude80": 427, 
  "\ude84": 325, 
  "\ude92": 245, 
  "\ude97": 239, 
  "\udea8": 232, 
  "\udeb4": 256, 
  "\udeb5": 339, 
  "\udeb6": 441, 
  "\udee9": 377, 
  "\udf04": 263, 
  "\udf08": 209, 
  "\udf0a": 319, 
  "\udf0c": 407, 
  "\udf15": 326, 
  "\udf19": 195, 
  "\udf1a": 224, 
  "\udf1d": 296, 
  "\udf1e": 182, 
  "\udf21": 429, 
  "\udf2c": 408, 
  "\udf33": 381, 
  "\udf39": 183, 
  "\udf3b": 141, 
  "\udf3c": 198, 
  "\udf3d": 298, 
  "\udf3e": 210, 
  "\udf3f": 347, 
  "\udf41": 432, 
  "\udf42": 388, 
  "\udf45": 205, 
  "\udf46": 422, 
  "\udf49": 279, 
  "\udf4b": 314, 
  "\udf4c": 244, 
  "\udf4d": 404, 
  "\udf4e": 211, 
  "\udf4f": 348, 
  "\udf52": 197, 
  "\udf53": 167, 
  "\udf54": 342, 
  "\udf55": 259, 
  "\udf56": 423, 
  "\udf58": 376, 
  "\udf59": 366, 
  "\udf5a": 321, 
  "\udf5c": 303, 
  "\udf5e": 361, 
  "\udf5f": 227, 
  "\udf61": 435, 
  "\udf63": 383, 
  "\udf65": 262, 
  "\udf66": 424, 
  "\udf69": 280, 
  "\udf6a": 322, 
  "\udf6f": 268, 
  "\udf71": 310, 
  "\udf72": 393, 
  "\udf7b": 446, 
  "\udf81": 417, 
  "\udf83": 369, 
  "\udf88": 236, 
  "\udf89": 165, 
  "\udf8a": 255, 
  "\udf8e": 275, 
  "\udf92": 295, 
  "\udfa3": 371, 
  "\udfa9": 352, 
  "\udfaa": 328, 
  "\udfaf": 338, 
  "\udfbf": 340, 
  "\udfc2": 241, 
  "\udfc3": 284, 
  "\udfc6": 433, 
  "\udfd3": 374, 
  "\udfda": 332, 
  "\udfdd": 390, 
  "\udff5": 323, 
  "\udffb": 115, 
  "\udffc": 134, 
  "\udffd": 119, 
  "\udffe": 128, 
  "\udfff": 100, 
  "\ufe0f": 96
}